const cities = {
  "آذربایجان شرقی": ["تبریز", "مراغه", "مرند", "اهر", "میانه"],
  "آذربایجان غربی": ["ارومیه", "خوی", "مهاباد", "بوکان", "سلماس"],
  اردبیل: ["اردبیل", "پارس‌آباد", "مشگین‌شهر", "خلخال", "گرمی"],
  اصفهان: ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر", "شاهین‌شهر"],
  البرز: ["کرج", "فردیس", "نظرآباد", "هشتگرد", "اشتهارد"],
  ایلام: ["ایلام", "دهلران", "ایوان", "مهران", "دره‌شهر"],
  بوشهر: ["بوشهر", "برازجان", "کنگان", "گناوه", "دیلم"],
  تهران: ["تهران", "شهریار", "اسلامشهر", "ورامین", "ری"],
  "چهارمحال و بختیاری": ["شهرکرد", "بروجن", "فارسان", "لردگان", "فرخ‌شهر"],
  "خراسان جنوبی": ["بیرجند", "قائن", "طبس", "نهبندان", "فردوس"],
  "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "قوچان"],
  "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "گرمه", "جاجرم"],
  خوزستان: ["اهواز", "دزفول", "آبادان", "خرمشهر", "اندیمشک"],
  زنجان: ["زنجان", "ابهر", "خرمدره", "قیدار", "هیدج"],
  سمنان: ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدیشهر"],
  "سیستان و بلوچستان": ["زاهدان", "چابهار", "ایرانشهر", "زابل", "سراوان"],
  فارس: ["شیراز", "مرودشت", "جهرم", "فسا", "کازرون"],
  قزوین: ["قزوین", "تاکستان", "الوند", "آبیک", "بوئین‌زهرا"],
  قم: ["قم", "قنوات", "جعفریه", "کهک", "دستجرد"],
  کردستان: ["سنندج", "سقز", "مریوان", "بانه", "قروه"],
  کرمان: ["کرمان", "رفسنجان", "سیرجان", "جیرفت", "بم"],
  کرمانشاه: ["کرمانشاه", "اسلام‌آباد غرب", "کنگاور", "هرسین", "سنقر"],
  "کهگیلویه و بویراحمد": ["یاسوج", "گچساران", "دهدشت", "سی‌سخت", "لیکک"],
  گلستان: ["گرگان", "گنبدکاووس", "علی‌آباد کتول", "مینودشت", "کلاله"],
  گیلان: ["رشت", "بندر انزلی", "لاهیجان", "لنگرود", "رودسر"],
  لرستان: ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز", "کوهدشت"],
  مازندران: ["ساری", "بابل", "آمل", "قائم‌شهر", "بهشهر"],
  مرکزی: ["اراک", "ساوه", "خمین", "محلات", "دلیجان"],
  هرمزگان: ["بندرعباس", "میناب", "قشم", "کیش", "بندر لنگه"],
  همدان: ["همدان", "ملایر", "نهاوند", "تویسرکان", "رزن"],
  یزد: ["یزد", "میبد", "اردکان", "بافق", "تفت"],
};

const getCityKeyboard = (province) => {
  const provinceCities = cities[province] || [];
  return {
    reply_markup: {
      inline_keyboard: provinceCities.map((city) => [
        { text: city, callback_data: `city_${city}` },
      ]),
    },
  };
};

export { cities, getCityKeyboard };
